Revit 2027 API
FailuresAccessor.CanRollBackPendingTransaction Method
 Checks if pending failure processing can be finished by rolling back a pending transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRollBackPendingTransaction()
Public Function CanRollBackPendingTransaction As Boolean
public:
bool CanRollBackPendingTransaction()
member CanRollBackPendingTransaction : unit -> bool
Return Value
Boolean
 True if there is a pending transaction and this transaction is allowed to be rolled back
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Check makes sense only if the failure processing is pending.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace